InformationRegisters/ПодключенияККлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПодключенияККлиенту</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодключений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодключенияККлиенту/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подключиться(Команда)
	
	яТД = Элементы.Список.ТекущиеДанные;
	яР = ITC_ПодключенияКлиент.ПодключитьсяККлиенту(яТД.Клиент, яТД.Название, яТД.ВидПодключения);
	Если Не яР.Успех Тогда
		Сообщить(яР.Сообщение);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьсяFullHD(Команда)
	
	яРазрешениеЭкрана = "
	|desktopwidth:i:1920
	|desktopheight:i:1080";
	яТД = Элементы.Список.ТекущиеДанные;
	яР = ITC_ПодключенияКлиент.ПодключитьсяККлиенту(яТД.Клиент, яТД.Название, яТД.ВидПодключения, яРазрешениеЭкрана);
	Если Не яР.Успех Тогда
		Сообщить(яР.Сообщение);
	КонецЕсли;
	
КонецПроцедуры
